# Pandas

-Kurulum: pandas.pydata.org da yazar.

    -Windows kullananlar icin:
    
        --baslat-->cmd yaz-->terminali calistir-->asagidakileri yaz.
            conda install numpy
            conda install matplotlib
            conda install pandas
 
-Pandas: Veri biliminin Excel'i gibidir.

-Kullanimi: pandas.pydata.org-->documentation da yazar.

-Pandas kutuphanesini kullanmak icin: import pandas as pd

In [6]:
import numpy as np
import pandas as pd

## Series:

In [7]:
benimSozluk = {"atil": 50, "zeynep": 40, "mehmet": 30}

In [8]:
pd.Series(benimSozluk)

atil      50
zeynep    40
mehmet    30
dtype: int64

In [9]:
benimYaslar = [50, 40, 30]
benimIsimler = ["atil", "zeynep", "mehmet"]

In [10]:
pd.Series(benimYaslar) #index no lari otomatik verildi

0    50
1    40
2    30
dtype: int64

In [11]:
pd.Series(data = benimYaslar, index = benimIsimler) #index ve data biz belirledik

atil      50
zeynep    40
mehmet    30
dtype: int64

In [12]:
numpyDizisi = np.array([50, 40, 30])

In [13]:
pd.Series(numpyDizisi)

0    50
1    40
2    30
dtype: int32

In [14]:
pd.Series(numpyDizisi, benimIsimler) #pd.Series(data, index)

atil      50
zeynep    40
mehmet    30
dtype: int32

## Series Ozellikleri:

In [15]:
pd.Series(["atil", "atlas", "osman"], [1, 2, 3]) #pd.Series(data, index)

1     atil
2    atlas
3    osman
dtype: object

In [16]:
yarismaSonucu1 = pd.Series([10, 5, 1], ["atil", "atlas", "osman"])
yarismaSonucu2 = pd.Series([20, 10, 8], ["atil", "atlas", "osman"])

In [17]:
yarismaSonucu2["atlas"] #index("atlas") verdik, data(10) geldi

10

In [18]:
sonSonuc = yarismaSonucu1 + yarismaSonucu2 #Seriler direk toplanabilir
sonSonuc

atil     30
atlas    15
osman     9
dtype: int64

In [19]:
farkliSeries1 = pd.Series([20 ,30 ,40 , 50], ["a", "b", "c", "d"])
farkliSeries2 = pd.Series([10 ,5 ,3 , 1], ["a", "c", "f", "g"])

In [20]:
farkliSeries1 + farkliSeries2 #Yalnizca indexleri kesi≈üen degerleri topladi, digerleri Nan olarak geldi.

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

## DataFrame:

Serilerin birlestirilmis hali gbi dusunulebilir. Bir nevi bir tablo gibi.

In [21]:
data = np.random.randn(4, 3) #4x3 luk rastgele float degerlerden olusan bir matris

In [22]:
dataFrame = pd.DataFrame(data)
dataFrame

#yukaridaki 0,1,2: kolonlar --> Kolonlarin her biri aslinda birer Seri.
#soldaki 0,1,2,3: indexler

          0         1         2
0 -1.063739  1.830444  0.020648
1 -1.657582  0.472745 -1.959529
2  1.618407 -0.670915 -1.317050
3  1.462490  0.178898 -0.387530

In [23]:
dataFrame[0] #0. kolonu getir

0   -1.063739
1   -1.657582
2    1.618407
3    1.462490
Name: 0, dtype: float64

In [24]:
yeniDataFrame = pd.DataFrame(data, index = ["atil", "zeynep", "atlas", "mehmet"], 
                             columns = ["maas", "yas", "saat"]) #pd.DataFrame(data, index, columns)
yeniDataFrame

            maas       yas      saat
atil   -1.063739  1.830444  0.020648
zeynep -1.657582  0.472745 -1.959529
atlas   1.618407 -0.670915 -1.317050
mehmet  1.462490  0.178898 -0.387530

In [25]:
yeniDataFrame["yas"] #kolon indexi yas olan kolonu getir

atil      1.830444
zeynep    0.472745
atlas    -0.670915
mehmet    0.178898
Name: yas, dtype: float64

In [26]:
yeniDataFrame[["maas", "yas"]] #2 kolon getir

            maas       yas
atil   -1.063739  1.830444
zeynep -1.657582  0.472745
atlas   1.618407 -0.670915
mehmet  1.462490  0.178898

In [27]:
#.loc: locate

yeniDataFrame.loc["atil"] #atil satirindaki verileri getirir

maas   -1.063739
yas     1.830444
saat    0.020648
Name: atil, dtype: float64

In [28]:
#.iloc: index bazli lokasyon. index mantigi da DataFrame'de calismaya dvm eder.

yeniDataFrame.iloc[0] #atilin verileri gelir

maas   -1.063739
yas     1.830444
saat    0.020648
Name: atil, dtype: float64

In [29]:
#DataFrame'e yeni kolon ekleme:

yeniDataFrame["emekli yasi"] = yeniDataFrame["yas"] + yeniDataFrame["yas"] #["emekliyasi"]: kolon indexi
yeniDataFrame

            maas       yas      saat  emekli yasi
atil   -1.063739  1.830444  0.020648     3.660887
zeynep -1.657582  0.472745 -1.959529     0.945489
atlas   1.618407 -0.670915 -1.317050    -1.341830
mehmet  1.462490  0.178898 -0.387530     0.357796

In [30]:
#DataFrame'den kolon silme:

yeniDataFrame.drop("emekli yasi", axis = 1) 
#axis = 1:kolon #kolondan emekliyasi verilerini sil
#orj veriyi etkilemez

            maas       yas      saat
atil   -1.063739  1.830444  0.020648
zeynep -1.657582  0.472745 -1.959529
atlas   1.618407 -0.670915 -1.317050
mehmet  1.462490  0.178898 -0.387530

In [31]:
#DataFrame'den satir silme:

yeniDataFrame.drop("mehmet", axis = 0) 
#axis = 0:satir #satirdan mehmetin verilerini sil
#orj veriyi etkilemez

            maas       yas      saat  emekli yasi
atil   -1.063739  1.830444  0.020648     3.660887
zeynep -1.657582  0.472745 -1.959529     0.945489
atlas   1.618407 -0.670915 -1.317050    -1.341830

In [32]:
#orj veride herhangi bir silinme olmaz
#emekliyasi ve mehmet duruyor

yeniDataFrame

            maas       yas      saat  emekli yasi
atil   -1.063739  1.830444  0.020648     3.660887
zeynep -1.657582  0.472745 -1.959529     0.945489
atlas   1.618407 -0.670915 -1.317050    -1.341830
mehmet  1.462490  0.178898 -0.387530     0.357796

In [33]:
# silme isleminde, orj. veride degisiklik yapmak icin

yeniDataFrame.drop("emekli yasi", axis= 1, inplace= True) #inplace: yerinde degisiklik yap
yeniDataFrame

            maas       yas      saat
atil   -1.063739  1.830444  0.020648
zeynep -1.657582  0.472745 -1.959529
atlas   1.618407 -0.670915 -1.317050
mehmet  1.462490  0.178898 -0.387530

In [34]:
yeniDataFrame.loc["atil"]["saat"] #atilin calisma saati gelir

0.020647897977678926

In [35]:
yeniDataFrame.loc["atil", "saat"] #yukaridaki ile ayni isi yapar

0.020647897977678926

In [36]:
yeniDataFrame < 0

         maas    yas   saat
atil     True  False  False
zeynep   True  False   True
atlas   False   True   True
mehmet  False  False   True

In [37]:
booleanFrame = yeniDataFrame < 0
booleanFrame

         maas    yas   saat
atil     True  False  False
zeynep   True  False   True
atlas   False   True   True
mehmet  False  False   True

In [38]:
yeniDataFrame #orj. duruyor

            maas       yas      saat
atil   -1.063739  1.830444  0.020648
zeynep -1.657582  0.472745 -1.959529
atlas   1.618407 -0.670915 -1.317050
mehmet  1.462490  0.178898 -0.387530

In [39]:
yeniDataFrame[booleanFrame] #yalnizca 0 dan kucuklerin degerini verir
#veya yeniDataFrame[yeniDataFrame < 0]

            maas       yas      saat
atil   -1.063739       NaN       NaN
zeynep -1.657582       NaN -1.959529
atlas        NaN -0.670915 -1.317050
mehmet       NaN       NaN -0.387530

In [40]:
yeniDataFrame[yeniDataFrame["yas"] > 0] #sadece yasi>0 olanlari gosterir

            maas       yas      saat
atil   -1.063739  1.830444  0.020648
zeynep -1.657582  0.472745 -1.959529
mehmet  1.462490  0.178898 -0.387530

## index degistirme:

In [41]:
yeniDataFrame.reset_index()
#orj. degistirmek icin inplace=True yapmak lazim. Yoksa orj.ni etkilemez.

    index      maas       yas      saat
0    atil -1.063739  1.830444  0.020648
1  zeynep -1.657582  0.472745 -1.959529
2   atlas  1.618407 -0.670915 -1.317050
3  mehmet  1.462490  0.178898 -0.387530

In [42]:
yeniDataFrame

            maas       yas      saat
atil   -1.063739  1.830444  0.020648
zeynep -1.657582  0.472745 -1.959529
atlas   1.618407 -0.670915 -1.317050
mehmet  1.462490  0.178898 -0.387530

In [43]:
yeniIndexListesi = ["ati", "zey", "atl", "meh"]
yeniDataFrame["yeni index"] = yeniIndexListesi #yeniIndexListesini once kolon ol. ekledik
yeniDataFrame.set_index("yeni index", inplace= True)
yeniDataFrame

                maas       yas      saat
yeni index
ati        -1.063739  1.830444  0.020648
zey        -1.657582  0.472745 -1.959529
atl         1.618407 -0.670915 -1.317050
meh         1.462490  0.178898 -0.387530

## multi index:

In [44]:
#olusturmak istedigimiz tablo gorseli orn olmasi acisindan-->excelden okuduk
data = pd.read_excel("pandasMultiIndex.xlsx") 
data

     disindex        icindex
0                             yas  meslek
1              homer simpson   40       A
2     simpson   bart simpson   10       B
3              marge simpson   30       C
4                    cartman    9       D
5  south park          kenny   10       E
6                       kyle   11       F

In [45]:
disIndexler = ["simpson","simpson","simpson","south park","south park","south park"]
icIndexler = ["homer simpson","bart simpson","marge simpson","cartman","kenny","kyle"]
birlesmisIndexler = list(zip(disIndexler, icIndexler)) #2 listeyi birlestir
birlesmisIndexler

[('simpson', 'homer simpson'),
 ('simpson', 'bart simpson'),
 ('simpson', 'marge simpson'),
 ('south park', 'cartman'),
 ('south park', 'kenny'),
 ('south park', 'kyle')]

In [46]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndexler) #MultiIndex #.from_tuples
birlesmisIndex

MultiIndex([(   'simpson', 'homer simpson'),
            (   'simpson',  'bart simpson'),
            (   'simpson', 'marge simpson'),
            ('south park',       'cartman'),
            ('south park',         'kenny'),
            ('south park',          'kyle')],
           )

In [47]:
cizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]
cizgiFilmNumpyDizi = np.array(cizgiFilmListem)
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizi, index= birlesmisIndex, columns= ["yas","meslek"])
#pd.DataFrame(data,index,columns)
cizgiFilmDataFrame

                         yas meslek
simpson    homer simpson  40      A
           bart simpson   10      B
           marge simpson  30      C
south park cartman         9      D
           kenny          10      E
           kyle           11      F

In [48]:
cizgiFilmDataFrame.loc["simpson"]

              yas meslek
homer simpson  40      A
bart simpson   10      B
marge simpson  30      C

In [53]:
cizgiFilmDataFrame.loc["south park"].loc["kenny"] #veya orn: .loc["south park"].iloc[1]

yas       10
meslek     E
Name: kenny, dtype: object

In [56]:
#indexlerin basliklarini degistirme:

cizgiFilmDataFrame.index.names = ["film isim", "karakter isim"]
cizgiFilmDataFrame

                         yas meslek
film isim  karakter isim
simpson    homer simpson  40      A
           bart simpson   10      B
           marge simpson  30      C
south park cartman         9      D
           kenny          10      E
           kyle           11      F

## eksik veriler:

In [58]:
#olusturmak istedigimiz tablo gorseli orn olmasi acisindan-->excelden okuduk
data2 = pd.read_excel("pandasEksikVeri.xlsx") 
data2

         ist. ank.  izmir
0   pzt.   30   20     40
1   sali   29    -     39
2  cars.    -   25     38

In [59]:
sozlukVerisi = {"ist": [30,29,np.nan],
               "ank": [20,np.nan,25],
               "izm": [40,39,38]}

havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)
havaDurumuDataFrame

    ist   ank  izm
0  30.0  20.0   40
1  29.0   NaN   39
2   NaN  25.0   38

In [60]:
havaDurumuDataFrame.dropna() #bos deger olan satirlari at, orj.i etkilemez

    ist   ank  izm
0  30.0  20.0   40

In [62]:
havaDurumuDataFrame.dropna(axis= 0) #yukarisi ile ayni.bos deger olan satirlari at, orj.i etkilemez

    ist   ank  izm
0  30.0  20.0   40

In [63]:
havaDurumuDataFrame.dropna(axis= 1) #bos deger olan kolonlari at, orj.i etkilemez

   izm
0   40
1   39
2   38

In [64]:
sozlukVerisi2 = {"ist": [30,29,np.nan],
               "ank": [20,np.nan,25],
               "izm": [40,39,38],
                "ant": [45,np.nan,np.nan]}

havaDurumuDataFrame2 = pd.DataFrame(sozlukVerisi2)
havaDurumuDataFrame2

    ist   ank  izm   ant
0  30.0  20.0   40  45.0
1  29.0   NaN   39   NaN
2   NaN  25.0   38   NaN

In [67]:
havaDurumuDataFrame2.dropna(axis= 1, thresh= 2)
#axis=1: kolondan, tresh=2:2 veya dha fazla nan deger olanlari at, orj.i etkilemez

    ist   ank  izm
0  30.0  20.0   40
1  29.0   NaN   39
2   NaN  25.0   38

In [69]:
havaDurumuDataFrame2.fillna(20) #nan(bos) degerleri 20 ile doldur

    ist   ank  izm   ant
0  30.0  20.0   40  45.0
1  29.0  20.0   39  20.0
2  20.0  25.0   38  20.0

## gruplandirmak:

In [72]:
maasSozluk = {"depart": ["yazilim","yazilim","pazar","pazar","hukuk","hukuk"],
             "calisan ismi": ["ahm","meh","ati","bur","zey","fur"],
             "maas": [1000,1500,2000,3000,4000,5000]
             }

maasDataFrame = pd.DataFrame(maasSozluk)
maasDataFrame

    depart calisan ismi  maas
0  yazilim          ahm  1000
1  yazilim          meh  1500
2    pazar          ati  2000
3    pazar          bur  3000
4    hukuk          zey  4000
5    hukuk          fur  5000

In [75]:
grupObjesi = maasDataFrame.groupby("depart") #departmanlara gore gruplandir.sql deki gibi

In [76]:
grupObjesi.count() #hangi departmanda, kac kisi var?

         calisan ismi  maas
depart
hukuk               2     2
pazar               2     2
yazilim             2     2

In [77]:
grupObjesi.mean() #departmanlarin ort. degeri

           maas
depart
hukuk    4500.0
pazar    2500.0
yazilim  1250.0

In [78]:
grupObjesi.min() #her departmandaki min deger

        calisan ismi  maas
depart
hukuk            fur  4000
pazar            ati  2000
yazilim          ahm  1000

In [79]:
grupObjesi.max()  #her departmandaki max deger

        calisan ismi  maas
depart
hukuk            zey  5000
pazar            bur  3000
yazilim          meh  1500

In [80]:
grupObjesi.describe() #tum tanimlamalari gosterir

         maas
        count    mean         std     min     25%     50%     75%     max
depart
hukuk     2.0  4500.0  707.106781  4000.0  4250.0  4500.0  4750.0  5000.0
pazar     2.0  2500.0  707.106781  2000.0  2250.0  2500.0  2750.0  3000.0
yazilim   2.0  1250.0  353.553391  1000.0  1125.0  1250.0  1375.0  1500.0

## concat (concatenation):

Kolon basliklari ayni olan verileri birlestirir.

Hepsini tek bir data halinde gosterir.

In [81]:
import numpy as np
import pandas as pd

In [88]:
#olusturmak istedigimiz tablo gorseli orn olmasi acisindan-->excelden okuduk
data3 = pd.read_excel("pandasConcat.xlsx") 
data3
#her birini ayri tablo varsayalim:

,,.1,.2,.3,.4,.5,.6,.7,.8,.9,.10,.11,.12,.13
0,index,isim,spor,kalori,,,,,,,,,,
1,0,ahm,kosu,100,,index,isim,spor,kalori,,,,,
2,1,meh,yuzme,200,,4,osm,kosu,200,,index,isim,spor,kalori
3,2,zey,kosu,250,,5,lev,yuzme,100,,8,ays,kosu,400
4,3,ati,basket,150,,6,atlas,kosu,50,,9,mah,yuzme,500
5,,,,,,7,fat,basket,300,,10,duy,basket,100
6,,,,,,,,,,,11,nur,tenis,200

In [89]:
sozluk1 = {"isim": ["ahm","meh","zey","ati"],
          "spor": ["kosu","yuzme","kosu","basket"],
          "kalori": [100,200,250,150]
          }

dataFrame1 = pd.DataFrame(sozluk1, index= [0,1,2,3]) #pd.DataFrame(data, index)

In [90]:
sozluk2 = {"isim": ["osm","lev","atlas","fat"],
          "spor": ["kosu","yuzme","kosu","basket"],
          "kalori": [200,100,50,300]
          }

dataFrame2 = pd.DataFrame(sozluk2, index= [4,5,6,7]) #pd.DataFrame(data, index)

In [91]:
sozluk3 = {"isim": ["ays","mah","duy","nur"],
          "spor": ["kosu","yuzme","basket","tenis"],
          "kalori": [400,500,100,200]
          }

dataFrame3 = pd.DataFrame(sozluk3, index= [8,9,10,11]) #pd.DataFrame(data, index)

In [108]:
pd.concat([dataFrame1, dataFrame2, dataFrame3]) #birlestir

     isim    spor  kalori
0     ahm    kosu     100
1     meh   yuzme     200
2     zey    kosu     250
3     ati  basket     150
4     osm    kosu     200
5     lev   yuzme     100
6   atlas    kosu      50
7     fat  basket     300
8     ays    kosu     400
9     mah   yuzme     500
10    duy  basket     100
11    nur   tenis     200

In [98]:
#Kolonlari birlestirmek icin:
pd.concat([dataFrame1, dataFrame2, dataFrame3], axis= 1)

   isim    spor  kalori   isim    spor  kalori isim    spor  kalori
0   ahm    kosu   100.0    NaN     NaN     NaN  NaN     NaN     NaN
1   meh   yuzme   200.0    NaN     NaN     NaN  NaN     NaN     NaN
2   zey    kosu   250.0    NaN     NaN     NaN  NaN     NaN     NaN
3   ati  basket   150.0    NaN     NaN     NaN  NaN     NaN     NaN
4   NaN     NaN     NaN    osm    kosu   200.0  NaN     NaN     NaN
5   NaN     NaN     NaN    lev   yuzme   100.0  NaN     NaN     NaN
6   NaN     NaN     NaN  atlas    kosu    50.0  NaN     NaN     NaN
7   NaN     NaN     NaN    fat  basket   300.0  NaN     NaN     NaN
8   NaN     NaN     NaN    NaN     NaN     NaN  ays    kosu   400.0
9   NaN     NaN     NaN    NaN     NaN     NaN  mah   yuzme   500.0
10  NaN     NaN     NaN    NaN     NaN     NaN  duy  basket   100.0
11  NaN     NaN     NaN    NaN     NaN     NaN  nur   tenis   200.0

## merge:

Kolonlari ortak olan datalari, tek data olarak gosterir.

In [100]:
mergeSozluk1 = {"isim": ["ahm","meh","zey","ati"],
          "spor": ["kosu","yuzme","kosu","basket"],
          }

mergeDataFrame1 = pd.DataFrame(mergeSozluk1, index= [0,1,2,3]) #pd.DataFrame(data, index)

In [101]:
mergeSozluk2 = {"isim": ["ahm","meh","zey","ati"],
          "kalori": [100,200,250,150]
          }

mergeDataFrame2 = pd.DataFrame(mergeSozluk2, index= [0,1,2,3]) #pd.DataFrame(data, index)

In [106]:
pd.merge(mergeDataFrame1, mergeDataFrame2, on= "isim") #on: ortak olan kolon

  isim    spor  kalori
0  ahm    kosu     100
1  meh   yuzme     200
2  zey    kosu     250
3  ati  basket     150

# Pandas Ileri Operasyonlar:

.unique(): tekil

.nunique(): tekil sayisi

.value_counts(): kacar tane

In [110]:
import numpy as np
import pandas as pd

In [111]:
maasSozluk2 = {"calisan ismi": ["ahm","meh","ati","bur","zey","fur"],
               "depart": ["yazilim","yazilim","pazar","pazar","hukuk","hukuk"],
               "maas": [1000,1500,2000,3000,4000,5000]
             }

maasDataFrame2 = pd.DataFrame(maasSozluk2)
maasDataFrame2

  calisan ismi   depart  maas
0          ahm  yazilim  1000
1          meh  yazilim  1500
2          ati    pazar  2000
3          bur    pazar  3000
4          zey    hukuk  4000
5          fur    hukuk  5000

In [112]:
#orn:
maasDataFrame2["depart"]

0    yazilim
1    yazilim
2      pazar
3      pazar
4      hukuk
5      hukuk
Name: depart, dtype: object

In [113]:
#.unique(): tekil
maasDataFrame2["depart"].unique() #tekil deparmanlari getirir

array(['yazilim', 'pazar', 'hukuk'], dtype=object)

In [114]:
#.nunique(): tekil sayisi
maasDataFrame2["depart"].nunique() #tekil departmanlarin sayisi-->yaz+paz+huk=3

3

In [115]:
#.value_counts(): kacar tane
maasDataFrame2["depart"].value_counts() #her bir departmandan kacar tane

yazilim    2
pazar      2
hukuk      2
Name: depart, dtype: int64

## Series lere de fonksiyon uygulanabilir:

.apply(): fonk.nu uygula

.isnull(): eksik deger var mi? True-evt var, False-hyr yok

.pivot_table()

appfunc= np.sum

In [117]:
def bruttenNete(maasx):
    return maasx * 0.66

In [118]:
maasDataFrame2["maas"].apply(bruttenNete) #fonk.nu uyg.

0     660.0
1     990.0
2    1320.0
3    1980.0
4    2640.0
5    3300.0
Name: maas, dtype: float64

In [119]:
maasDataFrame2.isnull() #eksik deger var mi? True-evt var, False-hyr yok

   calisan ismi  depart   maas
0         False   False  False
1         False   False  False
2         False   False  False
3         False   False  False
4         False   False  False
5         False   False  False

In [120]:
yeniSozlukVeri = {"Karakter sinifi": ["south park","south park","simpson","simpson","simpson"],
            "Karakter ismi": ["cartman", "kenny", "homer", "bart","marge"],
            "Karakter yas": [9,10,50,20,10]
           }
karakterDataFrame = pd.DataFrame(yeniSozlukVeri)

In [123]:
karakterDataFrame.pivot_table(values= "Karakter yas", index= ["Karakter sinifi", "Karakter ismi"])

                               Karakter yas
Karakter sinifi Karakter ismi
simpson         bart                     20
                homer                    50
                marge                    10
south park      cartman                   9
                kenny                    10